Core/src/Catalogs/ЕдиницыИзмерения/ЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЕдиницыИзмерения</name>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.КатегорииНоменклатуры</owners>
  <attributes>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодДляНалоговой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Весовая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Core/src/InformationRegisters/ВесИОбъемЕдиницТоваров/ВесИОбъемЕдиницТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВесИОбъемЕдиницТоваров</name>
  <resources>
    <name>Вес</name>
    <type>
      <types>DefinedType.Вес</types>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>DefinedType.Объем</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Catalogs/ЕдиницыИзмерения/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьВесИОбъемЕдиницыТовара();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьВесИОбъемЕдиницыТовара()
	
	Если Не ДополнительныеСвойства.Свойство("УказатьВесИОбъемДляЕдиницыТовара") Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ВесИОбъемЕдиницТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ЕдиницаИзмерения.Установить(Ссылка);
	
	Если ТипЗнч(Владелец) <> Тип("СправочникСсылка.Номенклатура") Тогда
		НаборЗаписей.Записать();
		Возврат;
	КонецЕсли;
	
	Если Не ДополнительныеСвойства.УказатьВесИОбъемДляЕдиницыТовара Тогда
		НаборЗаписей.Записать();
		Возврат;
	КонецЕсли;
	
	Запись = НаборЗаписей.Добавить();
	Запись.Номенклатура = Владелец;
	Запись.ЕдиницаИзмерения = Ссылка;
	Запись.Вес = ДополнительныеСвойства.Вес;
	Запись.Объем = ДополнительныеСвойства.Объем;
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
